dotfiles/dot-config/emacs/init.org
#+property: header-args :tangle "init.el"
#+startup: content indent
#+auto_tangle: t

* Early Init
:PROPERTIES:
:header-args: :tangle "early-init.el"
:END:
** Enable lexical bindings
#+begin_src emacs-lisp
  ;;; early-init.el -*- lexical-binding: t; -*-
#+end_src
** Ensure XDG directories are setup
#+begin_src emacs-lisp
  (defun bc-ensure-env (vars)
    "Ensure environment variables are set, using fallback value if unset.
  VARS is an alist of (VAR . FALLBACK) pairs."

    (dolist (pair vars)
      (let ((var (car pair))
            (fallback (cdr pair)))
        (unless (getenv var)
          (setenv var fallback)))))

  (bc-ensure-env
   `(("XDG_CONFIG_HOME" . ,(expand-file-name "~/.config"))
     ("XDG_CACHE_HOME" . ,(expand-file-name "~/.cache"))))
#+end_src
** Custom functions
All emacs cache stuff like elpa caches, savehist files, backups, etc should ideally live in the $XDG_CACHE_HOME
#+begin_src emacs-lisp
  (defun bc-emacs-cache-dir (subpath)
    "Return a full path to a subdirectory under XDG_CACHE_HOME."
    (file-name-concat (getenv "XDG_CACHE_HOME") "emacs" subpath))

  (defun bc-emacs-config-dir (subpath)
    "Return a full path to a subdirectory under XDG_CONFIG_HOME."
    (file-name-concat (getenv "XDG_CONFIG_HOME") "emacs" subpath))
#+end_src

** Ensure required directories are created before use
#+begin_src emacs-lisp
  ;; create relevant directories used later in config
  (make-directory (bc-emacs-cache-dir "history") t)
  (make-directory (bc-emacs-cache-dir "backup") t)
  (make-directory (bc-emacs-cache-dir "packages") t)
#+end_src

** Basic package configuration (use-package)
#+begin_src emacs-lisp
  (setopt package-user-dir (bc-emacs-cache-dir "packages")
  	    package-gnupghome-dir (bc-emacs-cache-dir "gnupg")
  	    )

  ;; elpa servers
  (setopt package-archives '(("melpa" . "https://melpa.org/packages/")
                             ("org" . "https://orgmode.org/elpa/")
                             ("elpa" . "https://elpa.gnu.org/packages/")
                             ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

  (setopt gnutls-algorithm-priority "NORMAL:+VERS-TLS1.3")

  ;; Initialize the package system early
  (package-initialize)

  ;; Set eln-cache dir
  (when (boundp 'native-comp-eln-load-path)
    (startup-redirect-eln-cache (bc-emacs-cache-dir "eln-cache")))

  (setopt use-package-always-ensure t)
#+end_src

** Put custom UI configuration in a separate file
#+begin_src emacs-lisp
  (setopt custom-file (locate-user-emacs-file (bc-emacs-cache-dir "custom-vars.el")))
  (load custom-file 'noerror 'nomessage)
#+end_src

** Clean startup
#+begin_src emacs-lisp
  (setopt
   blink-cursor-interval 0.7
   confirm-kill-emacs 'yes-or-no-p
   inhibit-startup-screen t
   inhibit-startup-message t
   initial-scratch-message ""
   inhibit-startup-echo-area-message (user-login-name)
   use-dialog-box nil
   use-short-answers t
   visible-bell nil ; do not flash the screen, when moving out of bounds, ex, pressing up when already at the first line.
   )

  (defun display-startup-echo-area-message ()
    (message "Let the hacking begin!"))
#+end_src
* Enable lexical bindings
#+begin_src emacs-lisp
  ;;; init.el -*- lexical-binding: t; -*-
#+end_src
* Backup / History & related configuration
** Save history
#+begin_src emacs-lisp
  ;; save history from previous sessions
  (setopt savehist-file (bc-emacs-cache-dir "history/savehist"))
  (savehist-mode 1)

  ;; clipboard history that survives restarts
  (setopt savehist-additional-variables
    	    '(search-ring regexp-search-ring kill-ring))

  ;; the kill ring can accumulate text properties (fonts, overlays, etc.) that bloat the savehist file, strip them before saving
  (add-hook 'savehist-save-hook
            (lambda ()
              (setq kill-ring
                    (mapcar #'substring-no-properties
                            (cl-remove-if-not #'stringp kill-ring)))))

  ;; Set the directory for auto-save files
  (setopt auto-save-list-file-prefix
          (file-name-concat (bc-emacs-cache-dir "auto-save-list") ".saves-"))
#+end_src

** Backup / versioning
#+begin_src emacs-lisp
  ;; backup settings
  (setopt backup-by-copying t
          backup-directory-alist `(("." . ,(bc-emacs-cache-dir "backup")))
          create-lockfiles nil
          delete-old-versions t
          kept-new-versions 4
          kept-old-versions 2
          version-control t
          )
#+end_src
** Transient
#+begin_src emacs-lisp
  (setopt transient-levels-file (bc-emacs-cache-dir "transient/levels.el")
          transient-values-file (bc-emacs-cache-dir "transient/values.el")
          transient-history-file (bc-emacs-cache-dir "transient/history.el"))
#+end_src
** Tramp history
#+begin_src emacs-lisp
  (setopt tramp-persistency-file-name (bc-emacs-cache-dir "tramp/persist")
          tramp-histfile-override (bc-emacs-cache-dir "tramp/history"))
#+end_src
** SVG lib cache
#+begin_src emacs-lisp
  (setopt svg-lib-icons-dir (bc-emacs-cache-dir "svg-lib"))
#+end_src
* General Emacs UI settings
** Basic configuration
#+begin_src emacs-lisp
  ;; disable fancy gui stuffs, menu et. all and other ui configs
  (menu-bar-mode -1)   ; disable the menu bar
  (mouse-avoidance-mode 'banish) ; banish the cursor as soon as i am typing
  (scroll-bar-mode -1) ; disable visible scrollbar
  (tool-bar-mode -1)   ; disable the toolbar
  (tooltip-mode -1)    ; disable tooltips
#+end_src
** Themes and Fonts
*** Theme
#+begin_src emacs-lisp
  ;; theme
  (use-package ef-themes
    :ensure t
    :demand t
    :init
    (ef-themes-take-over-modus-themes-mode 1)
    :bind
    (("<f5>" . modus-themes-rotate)
     ("C-<f5>" . modus-themes-select)
     ("M-<f5>" . modus-themes-load-random))
    :config
    ;; All customisations here.
    (setq modus-themes-mixed-fonts t)
    (setq modus-themes-italic-constructs t))

  (defun bc-load-theme ()
    (if (display-graphic-p)
        (modus-themes-load-theme 'ef-owl)
      (modus-themes-load-theme 'ef-owl)))

  ;; if emacs is running as daemon, then setting font dont work till frame is created
  (if (daemonp)
      (add-hook 'server-after-make-frame-hook #'bc-load-theme)
    (bc-load-theme))
#+end_src
*** Font
#+begin_src emacs-lisp
  ;; fonts/faces
  (defun bc-set-font-faces ()
    (cond
     ((eq system-type 'darwin)
      (set-face-attribute 'default nil :font "JetBrainsMono Nerd Font" :height 120)
      (set-face-attribute 'fixed-pitch nil :font "JetBrainsMono Nerd Font" :height 120)
      (set-face-attribute 'variable-pitch nil :font "Roboto" :height 120 :weight 'regular))
     (t
      (set-face-attribute 'default nil :font "JetBrainsMono Nerd Font" :height 120)
      (set-face-attribute 'fixed-pitch nil :font "JetBrainsMono Nerd Font" :height 120)
      (set-face-attribute 'variable-pitch nil :font "Roboto" :height 120 :weight 'regular))))

  ;; if emacs is running as daemon, then setting font dont work till frame is created
  (if (daemonp)
      (add-hook 'server-after-make-frame-hook #'bc-set-font-faces)
    (bc-set-font-faces))
#+end_src
** Editor UI
#+begin_src emacs-lisp
  (fringe-mode '(10 . 0)) ; give some space for the symbols (only of the left)
  (column-number-mode 't) ; show column number in the modeline

  (global-display-line-numbers-mode 0)

  ;; show line numbers in specific modes
  (use-package display-line-numbers
    :defer
    :custom
    (display-line-numbers-width-start t)
    :hook
    ((prog-mode . display-line-numbers-mode)
     (TeX-mode . display-line-numbers-mode)
     (markdown-mode . display-line-numbers-mode)
     (conf-mode . display-line-numbers-mode)))
#+end_src
** Modeline
#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :config
    (doom-modeline-mode 1)
    :custom
    ((doom-modeline-height 15)
     (doom-modeline-icon t)))

  (use-package spacious-padding
    :ensure t
    :custom
    (spacious-padding-subtle-mode-line t)
    (spacious-padding-widths '(
                               :internal-border-width 5
                               :header-line-width 4
                               :mode-line-width 6
                               :custom-button-width 3
                               :tab-width 4
                               :right-divider-width 1
                               :scroll-bar-width 8
                               :fringe-width 8))
    :config
    (spacious-padding-mode 1))
#+end_src
* Emacs Server
#+begin_src emacs-lisp
  (use-package server
    :ensure nil
    :defer 1
    :config
    (setopt server-client-instructions nil)
    (unless (server-running-p)
      (server-start))
    )
#+end_src

* Text editor settings
** Basic configuration
*** Encoding
#+begin_src emacs-lisp
  ;; coding system - utf8 everywhere
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
#+end_src
