dotfiles/dot-config/emacs/init.el
;;; init.el -*- lexical-binding: t; -*-

;; save history from previous sessions
(setopt savehist-file (bc-emacs-cache-dir "history/savehist"))
(savehist-mode 1)

;; clipboard history that survives restarts
(setopt savehist-additional-variables
  	    '(search-ring regexp-search-ring kill-ring))

;; the kill ring can accumulate text properties (fonts, overlays, etc.) that bloat the savehist file, strip them before saving
(add-hook 'savehist-save-hook
          (lambda ()
            (setq kill-ring
                  (mapcar #'substring-no-properties
                          (cl-remove-if-not #'stringp kill-ring)))))

;; Set the directory for auto-save files
(setopt auto-save-list-file-prefix
        (file-name-concat (bc-emacs-cache-dir "auto-save-list") ".saves-"))

;; backup settings
(setopt backup-by-copying t
        backup-directory-alist `(("." . ,(bc-emacs-cache-dir "backup")))
        create-lockfiles nil
        delete-old-versions t
        kept-new-versions 4
        kept-old-versions 2
        version-control t
        )

(setopt transient-levels-file (bc-emacs-cache-dir "transient/levels.el")
        transient-values-file (bc-emacs-cache-dir "transient/values.el")
        transient-history-file (bc-emacs-cache-dir "transient/history.el"))

(setopt tramp-persistency-file-name (bc-emacs-cache-dir "tramp/persist")
        tramp-histfile-override (bc-emacs-cache-dir "tramp/history"))

(setopt svg-lib-icons-dir (bc-emacs-cache-dir "svg-lib"))

;; disable fancy gui stuffs, menu et. all and other ui configs
(menu-bar-mode -1)   ; disable the menu bar
(mouse-avoidance-mode 'banish) ; banish the cursor as soon as i am typing
(scroll-bar-mode -1) ; disable visible scrollbar
(tool-bar-mode -1)   ; disable the toolbar
(tooltip-mode -1)    ; disable tooltips

;; theme
(use-package ef-themes
  :ensure t
  :demand t
  :init
  (ef-themes-take-over-modus-themes-mode 1)
  :bind
  (("<f5>" . modus-themes-rotate)
   ("C-<f5>" . modus-themes-select)
   ("M-<f5>" . modus-themes-load-random))
  :config
  ;; All customisations here.
  (setq modus-themes-mixed-fonts t)
  (setq modus-themes-italic-constructs t))

(defun bc-load-theme ()
  (if (display-graphic-p)
      (modus-themes-load-theme 'ef-owl)
    (modus-themes-load-theme 'ef-owl)))

;; if emacs is running as daemon, then setting font dont work till frame is created
(if (daemonp)
    (add-hook 'server-after-make-frame-hook #'bc-load-theme)
  (bc-load-theme))

;; fonts/faces
(defun bc-set-font-faces ()
  (cond
   ((eq system-type 'darwin)
    (set-face-attribute 'default nil :font "JetBrainsMono Nerd Font" :height 120)
    (set-face-attribute 'fixed-pitch nil :font "JetBrainsMono Nerd Font" :height 120)
    (set-face-attribute 'variable-pitch nil :font "Roboto" :height 120 :weight 'regular))
   (t
    (set-face-attribute 'default nil :font "JetBrainsMono Nerd Font" :height 120)
    (set-face-attribute 'fixed-pitch nil :font "JetBrainsMono Nerd Font" :height 120)
    (set-face-attribute 'variable-pitch nil :font "Roboto" :height 120 :weight 'regular))))

;; if emacs is running as daemon, then setting font dont work till frame is created
(if (daemonp)
    (add-hook 'server-after-make-frame-hook #'bc-set-font-faces)
  (bc-set-font-faces))

(fringe-mode '(10 . 0)) ; give some space for the symbols (only of the left)
(column-number-mode 't) ; show column number in the modeline

(global-display-line-numbers-mode 0)

;; show line numbers in specific modes
(use-package display-line-numbers
  :defer
  :custom
  (display-line-numbers-width-start t)
  :hook
  ((prog-mode . display-line-numbers-mode)
   (TeX-mode . display-line-numbers-mode)
   (markdown-mode . display-line-numbers-mode)
   (conf-mode . display-line-numbers-mode)))

(use-package doom-modeline
  :ensure t
  :config
  (doom-modeline-mode 1)
  :custom
  ((doom-modeline-height 15)
   (doom-modeline-icon t)))

(use-package spacious-padding
  :ensure t
  :custom
  (spacious-padding-subtle-mode-line t)
  (spacious-padding-widths '(
                             :internal-border-width 5
                             :header-line-width 4
                             :mode-line-width 6
                             :custom-button-width 3
                             :tab-width 4
                             :right-divider-width 1
                             :scroll-bar-width 8
                             :fringe-width 8))
  :config
  (spacious-padding-mode 1))

(use-package server
  :ensure nil
  :defer 1
  :config
  (setopt server-client-instructions nil)
  (unless (server-running-p)
    (server-start))
  )

;; coding system - utf8 everywhere
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)

(setq-default
