dotfiles/dot-config/emacs/init.el
 indent-tabs-mode nil
 tab-width 4
 tab-stop-list (number-sequence 4 180 4))

;; auto revert to on disk changes
(global-auto-revert-mode t)

;; require new line at the end
(setopt require-final-newline t)

(add-hook 'before-save-hook 'delete-trailing-whitespace)

(electric-pair-mode t)

;; more marks are always better
(setopt mark-ring-max 1000
        global-mark-ring-max 2000)

;; not sure why these are disabled by default; enable case toggle
(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)

;; assume left-to-right text everywhere and skip the bidirectional parenthesis algorithm
(setq-default bidi-display-reordering 'left-to-right
              bidi-paragraph-direction 'left-to-right)
(setopt bidi-inhibit-bpa t)

;; The `wgrep' packages lets us edit the results of a grep search
;; while inside a `grep-mode' buffer.  All we need is to toggle the
;; editable mode, make the changes, and then type C-c C-c to confirm
;; or C-c C-k to abort.
(use-package wgrep
  :ensure t
  :bind ( :map grep-mode-map
          ("e" . wgrep-change-to-wgrep-mode)
          ("C-x C-q" . wgrep-change-to-wgrep-mode)
          ("C-c C-c" . wgrep-finish-edit)))

(use-package markdown-mode
  :ensure t
  :defer t
  :config
  (setq markdown-fontify-code-blocks-natively t)
  )

(setopt help-window-select t)

(use-package ace-window
  :ensure t
  :config (ace-window-display-mode t)
  :custom
  (aw-scope 'frame)
  (aw-minibuffer-flag t)
  )

(defvar-keymap bc/windmove-keymap
  :repeat t
  "h" #'windmove-left
  "j" #'windmove-up
  "k" #'windmove-down
  "l" #'windmove-right
  )

(keymap-global-set "C-c w" bc/windmove-keymap)

;; The `vertico' package applies a vertical layout to the minibuffer.
;; It also pops up the minibuffer eagerly so we can see the available
;; options without further interactions.  This package is very fast
;; and "just works", though it also is highly customisable in case we
;; need to modify its behaviour.
(use-package vertico
  :ensure t
  :config
  (setopt vertico-cycle t
          vertico-resize nil)
  (vertico-mode t))

;; The `marginalia' package provides helpful annotations next to
;; completion candidates in the minibuffer.  The information on
;; display depends on the type of content.  If it is about files, it
;; shows file permissions and the last modified date.  If it is a
;; buffer, it shows the buffer's size, major mode, and the like.
(use-package marginalia
  :ensure t
  :config
  (marginalia-mode t))

;; The `consult' package provides lots of commands that are enhanced
;; variants of basic, built-in functionality.  One of the headline
;; features of `consult' is its preview facility, where it shows in
;; another Emacs window the context of what is currently matched in
;; the minibuffer.  Here I define key bindings for some commands you
;; may find useful.  The mnemonic for their prefix is "alternative
;; search" (as opposed to the basic C-s or C-r keys).
(use-package consult
  :ensure t
  :bind (("M-s M-g" . consult-ripgrep) ; a recursive grep
         ("M-s M-f" . consult-fd) ; search for files names recursively
         ("M-s M-o" . consult-outline) ; search through the outline (headings) of the file
         ("M-s M-l" . consult-line) ; search the current buffer
         ("M-s M-b" . consult-buffer) ; switch to another buffer, or bookmarked file, or recently opened file.
         ("M-s M-r" . consult-recent-file) ; search through recently opened files
         ))

;; The `orderless' package lets the minibuffer use an out-of-order
;; pattern matching algorithm.  It matches space-separated words or
;; regular expressions in any order.  In its simplest form, something
;; like "ins pac" matches `package-menu-mark-install' as well as
;; `package-install'.  This is a powerful tool because we no longer
;; need to remember exactly how something is named.
(use-package orderless
  :ensure t
  :custom
  (orderless-matching-styles '(orderless-literal orderless-prefixes))
  (completion-ignore-case t)
  :config
  (set-face-attribute 'orderless-match-face-0 nil
                      :foreground "#d70000")
  (set-face-attribute 'orderless-match-face-1 nil
                      :foreground "#005fd7")
  (set-face-attribute 'orderless-match-face-2 nil
                      :foreground "#007f3a")
  (set-face-attribute 'orderless-match-face-3 nil
                      :foreground "#d700d7")

  (setopt completion-styles '(orderless partial-completion basic)
          completion-category-overrides '(
                                          (file (styles orderless partial-completion basic))
                                          (buffer (styles orderless partial-completion basic))
                                          )
          )
  )

;; The `embark-consult' package is glue code to tie together `embark'
;; and `consult'.
(use-package embark-consult
  :ensure t)

;; The `embark' package lets you target the thing or context at point
;; and select an action to perform on it.  Use the `embark-act'
;; command while over something to find relevant commands.
;;
;; When inside the minibuffer, `embark' can collect/export the
;; contents to a fully fledged Emacs buffer.  The `embark-collect'
;; command retains the original behaviour of the minibuffer, meaning
;; that if you navigate over the candidate at hit RET, it will do what
;; the minibuffer would have done.  In contrast, the `embark-export'
;; command reads the metadata to figure out what category this is and
;; places them in a buffer whose major mode is specialised for that
;; type of content.  For example, when we are completing against
;; files, the export will take us to a `dired-mode' buffer; when we
;; preview the results of a grep, the export will put us in a
;; `grep-mode' buffer.
;;
(use-package embark
  :ensure t
  :bind (("C-." . embark-act)
         :map minibuffer-local-map
         ("C-c C-c" . embark-collect)
         ("C-c C-e" . embark-export)))

(setopt tab-always-indent 'complete)

(use-package corfu
  :hook
  (after-init . global-corfu-mode)
  :custom
  (corfu-cycle t) ; cycle around to first entry after reaching the last
  (corfu-preview-current nil) ; don't expand text at point until I press return
  (corfu-min-width 20)
  (corfu-on-exact-match 'show) ; complete if there is only a single candidate
  (corfu-quit-no-match t)
  (corfu-quit-at-boundary t)
  :config
  (setopt corfu-auto t
          corfu-auto-delay 0.2
          corfu-auto-prefix 1
          corfu-preselect 'prompt
          )
  (corfu-popupinfo-mode 1) ; shows documentation next to completions

  ;; sort by input history
  (with-eval-after-load 'savehist
    (corfu-history-mode 1)
    (add-to-list 'savehist-additional-variables 'corfu-history))
  )

(use-package kind-icon
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

(use-package cape
  :defer t
  :config
  (add-hook 'completion-at-point-functions #'cape-dabbrev 20) ; words from buffer
  (add-hook 'completion-at-point-functions #'cape-file 20))

(use-package dired
  :ensure nil
  :commands (dired)
  :config
  (setq  dired-kill-when-opening-new-dired-buffer t
         dired-listing-switches "-AGFhlv --group-directories-first --time-style=long-iso"))
