dotfiles/dot-config/emacs/init.org
** Recentf
#+begin_src emacs-lisp

  (use-package recentf
    :ensure nil
    :config
    (setopt recentf-auto-cleanup 'never
            recentf-max-menu-items 0
            recentf-max-saved-items 200
  	      recentf-save-file (bc-emacs-cache-dir "recentf"))
    (dolist (pattern `(,(bc-emacs-cache-dir "*") "/tmp/zsh.*\\.zsh"))
      (add-to-list 'recentf-exclude pattern))
    (recentf-mode t))
#+end_src
* Buffer management
** Kill ring
#+begin_src emacs-lisp
  (setopt save-interprogram-paste-before-kill t ; save the existing clipboard into the kill ring before overwriting it
  	    kill-do-not-save-duplicates t
  	    )
#+end_src
* Source control
#+begin_src emacs-lisp
  (setopt vc-follow-symlinks t)
  (use-package magit)
#+end_src
* Project management
** Treemacs
#+begin_src emacs-lisp
  (use-package treemacs
    :bind
    (("<f11>" . treemacs)
     ("C-<f11>" . treemacs-select-window))
    :hook
    ((treemacs-mode . treemacs-project-follow-mode)
     (treemacs-mode . treemacs-follow-mode))
    :config
    (setopt treemacs-persist-file (bc-emacs-cache-dir "treemacs/persist")
            treemacs-is-never-other-window t))
#+end_src

** Project
#+begin_src emacs-lisp
  (use-package project
    :init
    (setq project-vc-extra-root-markers '("Cargo.toml" "pyproject.toml" "requirements.txt" "go.mod"))
    :config
    (setopt project-list-file (bc-emacs-cache-dir "projects.el")))
#+end_src
* Keybindings
** Global
#+begin_src emacs-lisp
  (repeat-mode 1)

  ;; prevent C-z from sending emacs to background
  (global-unset-key (kbd "C-z"))

  ;; ace-window (switch between windows and frames)
  (global-set-key (kbd "M-o") 'ace-window)
#+end_src
** Which-Key
Shows available key bindings when a partial/prefix keybinding is invoked
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :init
    (which-key-mode)
    :config
    (setq which-key-idle-delay 0.1
          which-key-idle-secondary-delay 0.05
          which-key-sort-order 'which-key-key-order-alpha
          which-key-max-description-length 40))
#+end_src

* Org mode
** General
#+begin_src emacs-lisp
  (use-package org
    :ensure nil
    :config
    (setopt
     org-adapt-indentation t
     org-confirm-babel-evaluate nil
     org-hide-block-startup t
     org-startup-folded 'fold
     org-ellipsis "  ⤶"
     )
    )

  (org-babel-do-load-languages 'org-babel-load-languages '(
                                                           (emacs-lisp . t)
                                                           (python . t))
                               )
#+end_src
** Auto tangle
#+begin_src emacs-lisp
  ;; add the option #+auto_tangle: t in org files to auto tangle
  (use-package org-auto-tangle
    :defer t
    :hook
    (org-mode . org-auto-tangle-mode))
#+end_src
* Programming modes
** General
*** Prog mode - all programming modes inherits this
#+begin_src emacs-lisp
  (use-package prog-mode
    :ensure nil
    :hook
    ((prog-mode . subword-mode) ; useful to move through camel case words
     (prog-mode . which-function-mode) ; show the function name in the modeline
     (prog-mode . completion-preview-mode) ; show inline completion preview
     ))
#+end_src
*** Reformatter
#+begin_src emacs-lisp
  (use-package reformatter
    :ensure t)
#+end_src
*** Treesitter config
#+begin_src emacs-lisp
  (use-package treesit
    :ensure nil
    :config
    (setopt treesit-font-lock-level 3)
    ;; Define grammar sources
    (setq treesit-language-source-alist
          '((css . ("https://github.com/tree-sitter/tree-sitter-css" "v0.20.0"))
            (html . ("https://github.com/tree-sitter/tree-sitter-html" "v0.20.1"))
            (javascript . ("https://github.com/tree-sitter/tree-sitter-javascript" "v0.20.1" "src"))
            (json . ("https://github.com/tree-sitter/tree-sitter-json" "v0.20.2"))
            (python . ("https://github.com/tree-sitter/tree-sitter-python" "v0.20.4"))
            (toml . ("https://github.com/tree-sitter/tree-sitter-toml" "v0.5.1"))
            (tsx . ("https://github.com/tree-sitter/tree-sitter-typescript" "v0.20.3" "tsx/src"))
            (typescript . ("https://github.com/tree-sitter/tree-sitter-typescript" "v0.20.3" "typescript/src"))
            (yaml . ("https://github.com/ikatyang/tree-sitter-yaml" "v0.5.0"))
            (go . ("https://github.com/tree-sitter/tree-sitter-go"))
            (gomod . ("https://github.com/camdencheek/tree-sitter-go-mod"))

            (elisp "https://github.com/Wilfred/tree-sitter-elisp")
            (bash "https://github.com/tree-sitter/tree-sitter-bash")
            (cmake "https://github.com/uyha/tree-sitter-cmake")
            (rust "https://github.com/tree-sitter/tree-sitter-rust")
            (make "https://github.com/alemuller/tree-sitter-make")
            (markdown "https://github.com/ikatyang/tree-sitter-markdown")

            (heex "https://github.com/phoenixframework/tree-sitter-heex")
            (elixir "https://github.com/elixir-lang/tree-sitter-elixir")))
    ;; Remap major modes to their tree-sitter counterparts
    (dolist (mapping
             '((python-mode . python-ts-mode)
               (css-mode . css-ts-mode)
               (typescript-mode . typescript-ts-mode)
               (js2-mode . js-ts-mode)
               (bash-mode . bash-ts-mode)
               (conf-toml-mode . toml-ts-mode)
               (go-mode . go-ts-mode)
               (json-mode . json-ts-mode)
               (js-json-mode . json-ts-mode)
               (elixir-mode . elixir-ts-mode)))
      (add-to-list 'major-mode-remap-alist mapping))
    )

  (setq treesit--install-grammar-directory
        (bc-emacs-cache-dir "treesitter"))

  (defun bc-treesitter-config-reinstall-grammars ()
    "Force reinstallation of all grammars in `treesit-language-source-alist'.
    Use this to update grammars to their latest versions."
    (interactive)
    (dolist (lang-source treesit-language-source-alist)
      (let ((lang (car lang-source)))
        (message "Treesitter: Reinstalling grammar for %s..." lang)
        (cl-letf (((symbol-function 'y-or-n-p) (lambda (&rest _) t)))
          (treesit-install-language-grammar lang)))))

#+end_src
** Ediff
#+begin_src emacs-lisp
  (use-package ediff
    :ensure nil
    :config
    (setopt ediff-split-window-function 'split-window-horizontally
            ediff-window-setup-function 'ediff-setup-windows-plain
            ediff-keep-variants nil
            ediff-make-buffers-readonly-at-startup nil
            ediff-show-clashes-only t))
#+end_src

** Language server (eglot)
#+begin_src emacs-lisp
  (use-package eglot
    :ensure nil
    :functions (eglot-ensure)
    :commands (eglot)
    :hook
    (prog-mode . eglot-ensure)
    :config
    (set-face-attribute 'eglot-highlight-symbol-face nil
                        :foreground "#ffd700"
                        :underline t)
    (setq eglot-workspace-configuration
          '(:java (:completion (:guessMethodArguments :json-false))))
    )
#+end_src
** Ansible
#+begin_src emacs-lisp
  (defun ansible-vault-mode-maybe ()
    (when (ansible-vault--is-encrypted-vault-file)
      (ansible-vault-mode 1)))

  (use-package poly-ansible)

  (use-package ansible-vault
    :init
    (add-hook 'yaml-mode-hook 'ansible-vault-mode-maybe)
    :config
    (setq ansible-vault-password-file "~/.ansible/vault-password"))
#+end_src
** Docker
#+begin_src emacs-lisp
  (use-package dockerfile-mode)
#+end_src
** Golang
#+begin_src emacs-lisp
  (use-package go-ts-mode
    :init
    (add-to-list 'auto-mode-alist '("\\.go\\'" . go-ts-mode))
    (add-to-list 'auto-mode-alist '("/go\\.mod\\'" . go-mod-ts-mode))
    :hook
    ((go-ts-mode . eglot-ensure)
     (go-ts-mode . go-format-on-save-mode))
    :config
    (reformatter-define go-format
                        :program "goimports"
                        :args '("/dev/stdin"))
    )
#+end_src
** SOPS
#+begin_src emacs-lisp
  (use-package sops
    :ensure t
    :bind (("C-c C-c" . sops-save-file)
           ("C-c C-k" . sops-cancel)
           ("C-c C-d" . sops-edit-file))
    :init
    (global-sops-mode 1))
#+end_src
** Terraform
#+begin_src emacs-lisp
  (use-package terraform-mode
    :config
    (setopt terraform-indent-level 2)
    :hook
    (terraform-mode . terraform-format-on-save))
#+end_src
** YAML
#+begin_src emacs-lisp
  (use-package yaml-mode
    :hook
    (yaml-mode . (lambda ()
                   (electric-indent-local-mode -1))))
#+end_src
* Shell
** Eshell
#+begin_src emacs-lisp
  (setopt eshell-directory-name (bc-emacs-cache-dir "eshell"))
#+end_src
** Eat - Emulate A Terminal
https://codeberg.org/akib/emacs-eat

#+begin_src emacs-lisp
  (use-package eat
    :ensure t
    :bind (("C-c t" . eat))
    :config
    (setq eat-kill-buffer-on-exit t))
#+end_src
* News / RSS
