dotfiles/dot-config/emacs/init.el

(use-package elfeed
  :ensure t
  :bind
  (("C-c r e" . elfeed))
  :config
  (setq elfeed-db-directory (bc-emacs-cache-dir "elfeed-db")
        elfeed-feeds
        '(("https://karthinks.com/index.xml" dev emacs)
          ("https://feeds.feedburner.com/TheHackersNews" security cyber tech news)
          ("https://feed.itsfoss.com/" linux tech news)
          ("https://www.apalrd.net/index.xml" tech blog))))

(use-package eww
  :ensure nil
  :init
  (setopt browse-url-browser-function 'browse-url-default-browser
          url-configuration-directory (bc-emacs-cache-dir "url")
          url-cookie-file (bc-emacs-cache-dir "url/cookies"))
  :config
  (setopt eww-auto-rename-buffer 'title
          browse-url-browser-function 'eww-browse-url))

(use-package olivetti)
